#+TITLE: my-memacs-config
#+PROPERTY: header-args :tangle elisp.ls

* Prerequisites

Install the python LSP server:

#+begin_src bash :tangle no
pip install 'python-lsp-server[all]'
#+end_src

For ellama you need a local LLM running:

#+begin_src bash :tangle no
brew install ollama
#+end_src

Use the Zephyr model:
#+begin_src bash :tangle no
ollama pull zephyr
#+end_src

* Installation:

#+begin_src bash :tangle no
make
#+end_src

** macos

*** ITerm2

Q: How do I make the option/alt key act like Meta or send escape codes?
A: Go to Preferences > Profiles tab. Select your profile on the left, and then open the Keyboard tab. At the bottom is a set of buttons that lets you select the behavior of the Option key. For most users, Esc+ will be the best choice.

** AI

*** Github Copilot

https://github.com/copilot-emacs/copilot.el

Install copilot language server
#+begin_src bash :tangle no
npm install -g @github/copilot-language-server
#+end_src


* Common Commands:

| C-x C-f | Open file browser   |
| C-x C-c | Quit Emacs          |
| F10     | Open menu           |
| C-g     | Quit current action |

* Navigating

| C-x o      | Switch between windows |
| C-x b      | Switch between buffers |
| C-x 0      | Close window |

* Editing

| C-_             | Undo                                                            |
| C-/             | Undo                                                            |
| C-g C-_         | Redo                                                            |
| C-g C-/         | Redo                                                            |
| C-u <n> <input> | Repeates actions (e.g. C-u 8 * is adding eight * to the buffer) |

** Shell commands

| M-x term   | Open terminal          |
| M-x shell  | Open shell     |
| M-!        | execute shell command  |

** Spell check

| M-$                          | Spellcheck the word below the cursor |
| M-x ispell                   | Spellcheck buffer                    |
| M-x ispell-change-dictionary | Change spelling language             |

* Org Mode Commands

| TAB     | Un-/Fold a section   |
| C-c C-c | Execute a code block |

** Projectile

| C-c p p | Switch project       |
| C-c p f | Open file in project |


** elisp examples:

Getting the Emacs version

say hello

#+begin_src emacs-lisp
(message "Hello, World!")
#+end_src

#+RESULTS:
: Hello, World!


For more see [[[[file:elisp.org]]]]

** How to tangle the code blocks

#+begin_src bash :tangle no
emacs --batch README.org  -f org-babel-tangle
#+end_src

#+RESULTS:
